app/views/users/show.html.erb

SELECT COUNT(*) FROM "stocks" INNER JOIN "user_stocks" ON "stocks"."id" = "user_stocks"."stock_id" WHERE "user_stocks"."user_id" = ?  [["user_id", 2]]
---

	<% if @user.stocks.size > 0 %>