app/controllers/friendship_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? ORDER BY "friendships"."id" ASC LIMIT ?  [["user_id", 4], ["friend_id", 2], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 5]]
---
	def destroy
		@friendship = current_user.friendships.where(friend_id: params[:id]).first
		@friendship.destroy