app/controllers/user_stocks_controller.rb

  def create
    if params[:stock_id].present?
      @user_stock = UserStock.new(stock_id: params[:stock_id], user: current_user)
    else
      stock = Stock.find_by_ticker(params[:stock_ticker])
      if stock
        @user_stock = UserStock.new(user: current_user, stock: stock)
      else
        stock = Stock.new_from_lookup(params[:stock_ticker])
        if stock.save
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ? ORDER BY "stocks"."id" ASC LIMIT ?  [["ticker", "GOOG"], ["LIMIT", 1]]
INSERT INTO "stocks" ("ticker", "name", "last_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ticker", "GOOG"], ["name", "Alphabet Inc."], ["last_price", 912.18], ["created_at", "2017-07-03 19:37:08.421035"], ["updated_at", "2017-07-03 19:37:08.421035"]]

  def destroy
    @user_stock.destroy
---
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = ?  [["id", 1]]

    def set_user_stock
      @user_stock = UserStock.find(params[:id])
---
SELECT  "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]