app/controllers/users_controller.rb

	def search
		@users = User.search(params[:search_param])
---
SELECT "users".* FROM "users" WHERE (lower(first_name) like '%alves')

	def add_friend
		@friend = User.find(params[:friend])
		current_user.friendships.build(friend_id: @friend.id)

		if current_user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 4], ["created_at", "2017-07-05 19:01:44.079954"], ["updated_at", "2017-07-05 19:01:44.079954"]]